let person = [
    "джеймсон",
    "олег",
    "саша",
    "ума",
    "стэйтем",
    "обама",
    "гилмор",
    "роналду",
    "рон",
    "клена",
    "джиган",
    "нагиев",
    "кирилл",
    "мюллер",
    "пушной",
    "недотепкин",
    "степа",
    "костя",
    "соня",
    "багров",
    "надаль",
    "шерлок",
    "матвей",
    "никита",
    "сноу",
    "якубович",
    "паркер",
    "илья",
    "макс",
    "луи",
    "карлсен",
    "мальцев",
    "билан",
    "маликов",
    "алюков",
    "букина",
    "рыжий",
    "лектер",
    "леша",
    "прусикин",
    "дюфрейн",
    "граймс",
    "круз",
    "воробей",
    "плющенко",
    "клюев",
    "цой",
    "быков",
    "блинова",
    "шварц",
    "баринов",
    "козлов",
    "путин",
    "ефремов",
    "рост",
    "друзь",
    "киркоров",
    "степаненко",
    "джексон",
    "наумов",
    "барецкий",
    "полянина",
    "керри",
    "пушкин",
    "жирик",
    "хэммет",
    "соболев",
    "губерниев",
    "гарус",
    "джаггер",
    "скоц",
    "сергей",
    "щербенок",
    "собчак",
    "ревва",
    "лебедев",
    "ярушин",
    "светлаков",
    "инга",
    "галустян",
    "высоцкий",
    "харламов",
    "уотерс",
    "депардье",
    "зики",
    "марти",
    "комарова",
    "ален",
    "хэтфилд",
    "даша",
    "корнеев",
    "валуев",
    "коля",
    "шклярский",
    "боярский",
    "люся",
    "градский",
    "поттер",
    "якин",
    "лазарев"
]

let action = [
    "поднимаетсяполестнице",
    "бегает",
    "стоитвпланке",
    "ест",
    "играетвприставку",
    "водитмашину",
    "проверяетзрение",
    "играетвфутбол",
    "играетвбильярд",
    "танцует",
    "проходитдосмотр",
    "едетвлифте",
    "катаетсянаконьках",
    "рыбачит",
    "моется",
    "играетвгольф",
    "играетвкс",
    "выступает",
    "играетвволейбол",
    "стреляет",
    "играетвтеннис",
    "курит",
    "делаетмакияж",
    "подстригается",
    "плавает",
    "подтягивается",
    "едетвавтобусе",
    "едетнаэксалаторе",
    "скачетналошади",
    "наливает",
    "играетвшахматы",
    "идетвшколу",
    "лечитзубы",
    "прыгаетнаскакалке",
    "ползет",
    "сидитнаунитазе",
    "играетврулетку",
    "прыгаетчерезкозла",
    "катаетсянароликах",
    "поднимаетсяпоканату",
    "читает",
    "выкидываетмусор",
    "плыветналодке",
    "бреется",
    "паритсявбане",
    "меситтесто",
    "едетнамотоцикле",
    "чиниткрышу",
    "собираетшкаф",
    "жаритшашлыки",
    "пишетмелом",
    "растягивается",
    "жонглирует",
    "прыгаетнабатуте",
    "бежитпополю",
    "жметлежа",
    "краситзабор",
    "химичит",
    "катаетсянаемеле",
    "работаетнаогороде",
    "едетнавелосипеде",
    "играетнапианино",
    "моетполы",
    "качаетсянакачеле",
    "играетвхоккей",
    "катаетсясгорки",
    "едетнаколяске",
    "ждетваэропорте",
    "клеит",
    "расплачивается",
    "играетвкарты",
    "доиткорову",
    "едетнасамокате",
    "закапывает",
    "шьет",
    "катаетсянатюбинге",
    "лепитснеговика",
    "колетдрова",
    "вяжет",
    "копаеткартошку",
    "занимаетсянафитболе",
    "взбиваетковер",
    "катаетсяналыжах",
    "летитвсамолете",
    "ходитпомагазину",
    "катаетсянаскейтборде",
    "сушитголову",
    "ходитнакостылях",
    "играетвбаскетбол",
    "спускаетсянапарашюте",
    "крестится",
    "жариткартошку",
    "свистит",
    "едетнапоезде",
    "сидитвкинотеатре",
    "меняетрезину",
    "играетнабарабанах",
    "летитнаметле",
    "бьетгрушу",
    "лазает"
]

let object = [
    "крона",
    "банан",
    "череп",
    "книга",
    "айфон",
    "корова",
    "свирель",
    "мяч",
    "гармошка",
    "лупа",
    "супра",
    "знак",
    "ананас",
    "ключ",
    "стул",
    "бусы",
    "кошка",
    "крестик",
    "перчатка",
    "5000",
    "чайник",
    "киндер",
    "бас",
    "магнит",
    "часы",
    "апельсин",
    "рулон",
    "гантель",
    "карта",
    "кошелек",
    "дротик",
    "нож",
    "цветок",
    "валик",
    "лампочка",
    "кабель",
    "градусник",
    "пластилин",
    "доширак",
    "билет",
    "водка",
    "спичка",
    "завтраки",
    "дуршлаг",
    "вилка",
    "тюбетейка",
    "каподастр",
    "спиннер",
    "коробок",
    "бокал",
    "сковородка",
    "помидор",
    "галстук",
    "калькулятор",
    "цепь",
    "веер",
    "трещотка",
    "рогатка",
    "ключи",
    "киви",
    "свисток",
    "игральныекости",
    "синтезатор",
    "парящаяптица",
    "вино",
    "кегля",
    "ножницы",
    "ручка",
    "змейкарубика",
    "денежнаяжаба",
    "слайд",
    "линейка",
    "фонарик",
    "диск",
    "кубикрубика",
    "бутылка",
    "терка",
    "топор",
    "бочоноклото",
    "зубная шетка",
    "хубабуба",
    "утюг",
    "сюрикен",
    "мороженое",
    "ракушка",
    "эспандер",
    "компьютер",
    "вентилятор",
    "календарь",
    "молния",
    "балалайка",
    "свечка",
    "теннисныймяч",
    "прищепка",
    "юла",
    "яблоко",
    "глобус",
    "мышка",
    "дискета",
    "наушники"
]

let defaultDigitsColor = 'black';
let correctDigitsColor = 'springgreen';

let rp = [];
let ra = [];
let ro = [];

let timeout = 100;
let timePassed = 0;
let answered = 0;

let cursor = 0;

function onStartButtonClick() {
    $(".button").hide();
    $(".input").show();
    startTraining();
}

function startTraining() {
    answered = 0;
    generateRandomSet();
    startTimer();
    showDigits();
}

function finishTraining() {

}

function onInput() {
    let word = $('#textInput').val();
    let required;

    console.log(cursor);

    switch (cursor) {
        case 0:
            required = person[rp[answered]];
            break;
        case 1:
            required = action[ra[answered]];
            break;
        case 2:
            required = object[ro[answered]];
            break;
    }

    if (checkWord(word, required)) {
        cursor = (cursor + 1) % 3;
        highlightDigits(cursor);
        $('#textInput').focus();
        $('#textInput').val('');

        if (cursor === 0) {
            answered++;
            showDigits();
        }
    }
}

function highlightDigits(number) {
    $("#digits1").css('color', defaultDigitsColor);
    $("#digits2").css('color', defaultDigitsColor);
    $("#digits3").css('color', defaultDigitsColor);

    switch (number) {
        case 2:
            $("#digits2").css('color', correctDigitsColor);
        case 1:
            $("#digits1").css('color', correctDigitsColor);
    }
}

function checkWord(word, required) {
    return word.toLowerCase().replace(/ /g,'') === required.toLowerCase();
}

function showDigits() {
    $('#textInput').focus();
    $("#progress").html(answered);
    $("#digits1").html(digitToText(rp[answered]));
    $("#digits2").html(digitToText(ra[answered]));
    $("#digits3").html(digitToText(ro[answered]));
}

function digitToText(value) {
    return (value >= 10) ? value : "0" + value;
}

function generateRandomSet() {
    rp = [];
    ra = [];
    ro = [];
    let np = [];
    let na = [];
    let no = [];
    for (let i = 0; i < 100; i++) {
        np.push(i);
        na.push(i);
        no.push(i);
    }
    for (let i = 99; i >= 0; i--) {
        let randP = randomInteger(0, i);
        let randA = randomInteger(0, i);
        let randO = randomInteger(0, i);
        rp.push(np[randP]);
        ra.push(na[randA]);
        ro.push(no[randO]);
        np.splice(randP, 1);
        na.splice(randA, 1);
        no.splice(randO, 1);
    }
}


function randomInteger(min, max) {
    let rand = min + Math.random() * (max + 1 - min);
    return Math.floor(rand);
}



// ----- TIMER -----

function startTimer() {
    timePassed = 0;

    timerInterval = setInterval(() => {
        timePassed++;
        displayTime();

        if (answered === 100) {
            finishTraining();
        }

    }, timeout);
}


function endTimer() {
    clearInterval(timerInterval);
}


function displayTime() {
    let seconds = Math.floor(timePassed / 10);
    let minutes = Math.floor(seconds / 60);
    seconds = seconds % 60;
    if (seconds < 10) {
        seconds = "0" + seconds;
    }

    $('#timer').html(`${minutes}:${seconds}`);
}